[
    {
        "product_name": "TechGadget",
        "product_image": "https://i.ibb.co/qrYTpnc/176744.jpg",
        "description": "TechGadget enhances productivity and streamlines workflow for tech enthusiasts. Featuring cutting-edge technology, this tool integrates seamlessly with your existing setup, providing a user-friendly interface and powerful functionalities. Whether you're a developer, designer, or tech-savvy individual, TechGadget offers a range of features to help you work smarter, not harder. From task automation to real-time collaboration, TechGadget is your go-to solution for boosting efficiency and achieving more in less time.",
        "product_owner_info": {
            "owner_name": "Jane Doe",
            "owner_image": "https://ibb.co/1KqjzhX",
            "owner_email": "janedoe@example.com"
        },
        "tags": [
            "productivity",
            "tech",
            "innovation"
        ],
        "external_links": [
            "https://techgadget.com",
            "https://github.com/techgadget"
        ],
        "upvote_count": 120,
        "downvote_count": 5,
        "creation_time": {
            "$date": "2023-05-15T09:00:00Z"
        }
    },
    {
        "product_name": "AIWriter",
        "product_image": "https://i.ibb.co/DMr2P4Q/2147785010.jpg",
        "description": "AIWriter uses AI to generate creative and engaging content. Leveraging advanced natural language processing algorithms, AIWriter can draft articles, blog posts, and even creative stories with minimal input. It's designed to assist writers, marketers, and content creators in producing high-quality content efficiently. With AIWriter, you can overcome writer's block, enhance your writing style, and save time on content creation, allowing you to focus on more strategic tasks.",
        "product_owner_info": {
            "owner_name": "John Smith",
            "owner_image": "https://ibb.co/KGXsMMc",
            "owner_email": "johnsmith@example.com"
        },
        "tags": [
            "AI",
            "writing",
            "automation"
        ],
        "external_links": [
            "https://aiwriter.com",
            "https://github.com/aiwriter"
        ],
        "upvote_count": 200,
        "downvote_count": 10,
        "creation_time": {
            "$date": "2023-04-10T14:30:00Z"
        }
    },
    {
        "product_name": "GameMaster",
        "product_image": "https://i.ibb.co/kcZW3zZ/39554.jpg",
        "description": "GameMaster is a platform for discovering and playing indie games. It offers a curated selection of games created by independent developers, providing a unique and diverse gaming experience. With GameMaster, gamers can explore new and innovative games that push the boundaries of creativity and gameplay. The platform also supports community engagement, allowing users to rate, review, and discuss their favorite games. Whether you're looking for action, adventure, or puzzle games, GameMaster has something for everyone.",
        "product_owner_info": {
            "owner_name": "Jane Doe",
            "owner_image": "https://ibb.co/1KqjzhX",
            "owner_email": "janedoe@example.com"
        },
        "tags": [
            "games",
            "indie",
            "entertainment"
        ],
        "external_links": [
            "https://gamemaster.com",
            "https://github.com/gamemaster"
        ],
        "upvote_count": 350,
        "downvote_count": 15,
        "creation_time": {
            "$date": "2023-03-20T11:45:00Z"
        }
    },
    {
        "product_name": "HealthTracker",
        "product_image": "https://i.ibb.co/JQk4ZKb/124254.jpg",
        "description": "HealthTracker helps you monitor and improve your health. With its comprehensive suite of tools, you can track your daily activity, diet, and sleep patterns. HealthTracker provides personalized insights and recommendations to help you achieve your fitness goals. The app integrates with various wearable devices to give you real-time data and analytics. Whether you're aiming to lose weight, build muscle, or maintain a healthy lifestyle, HealthTracker offers the support and motivation you need to succeed.",
        "product_owner_info": {
            "owner_name": "Jane Doe",
            "owner_image": "https://ibb.co/1KqjzhX",
            "owner_email": "janedoe@example.com"
        },
        "tags": [
            "health",
            "fitness",
            "wellness"
        ],
        "external_links": [
            "https://healthtracker.com",
            "https://github.com/healthtracker"
        ],
        "upvote_count": 180,
        "downvote_count": 8,
        "creation_time": {
            "$date": "2023-02-25T08:15:00Z"
        }
    },
    {
        "product_name": "EduLearn",
        "product_image": "https://i.ibb.co/kx30DYx/2150062212.jpg",
        "description": "EduLearn offers interactive courses for a variety of subjects. Designed for students and lifelong learners, EduLearn provides engaging and informative lessons on topics ranging from technology and science to arts and humanities. The platform features video lectures, interactive quizzes, and hands-on projects to enhance learning outcomes. EduLearn also offers certification programs to help you advance your career or pursue new interests. With EduLearn, you can learn at your own pace and access high-quality educational resources from anywhere.",
        "product_owner_info": {
            "owner_name": "Sarah Green",
            "owner_image": "https://ibb.co/b6WcNFG",
            "owner_email": "sarahgreen@example.com"
        },
        "tags": [
            "education",
            "learning",
            "courses"
        ],
        "external_links": [
            "https://edulearn.com",
            "https://github.com/edulearn"
        ],
        "upvote_count": 250,
        "downvote_count": 12,
        "creation_time": {
            "$date": "2023-01-30T13:20:00Z"
        }
    },
    {
        "product_name": "FinanceGuru",
        "product_image": "https://i.ibb.co/4SnDfX3/3481.jpg",
        "description": "FinanceGuru provides tools for managing personal finances. The platform offers budgeting tools, expense tracking, and investment management features to help you achieve your financial goals. With FinanceGuru, you can create custom budgets, monitor your spending, and receive personalized financial advice. The app also includes features for tracking your credit score, planning for retirement, and managing debt. Whether you're looking to save money, invest wisely, or achieve financial independence, FinanceGuru has the tools and resources you need.",
        "product_owner_info": {
            "owner_name": "David Williamson",
            "owner_image": "https://ibb.co/4FF340j",
            "owner_email": "davidwilliamson@example.com"
        },
        "tags": [
            "finance",
            "budgeting",
            "investment"
        ],
        "external_links": [
            "https://financeguru.com",
            "https://github.com/financeguru"
        ],
        "upvote_count": 220,
        "downvote_count": 9,
        "creation_time": {
            "$date": "2023-04-05T10:05:00Z"
        }
    },
    {
        "product_name": "TravelBuddy",
        "product_image": "https://i.ibb.co/yFxLK70/133944.jpg",
        "description": "TravelBuddy helps you plan and book your perfect trip. With TravelBuddy, you can explore destinations, find travel deals, and book accommodations all in one place. The platform offers personalized travel recommendations based on your preferences and budget. TravelBuddy also includes features for creating and sharing travel itineraries, discovering local attractions, and connecting with other travelers. Whether you're planning a solo adventure or a family vacation, TravelBuddy makes it easy to organize and enjoy your travels.",
        "product_owner_info": {
            "owner_name": "Laura Blue",
            "owner_image": "https://ibb.co/L11ZGP6",
            "owner_email": "laurablue@example.com"
        },
        "tags": [
            "travel",
            "booking",
            "adventure"
        ],
        "external_links": [
            "https://travelbuddy.com",
            "https://github.com/travelbuddy"
        ],
        "upvote_count": 300,
        "downvote_count": 7,
        "creation_time": {
            "$date": "2023-03-10T07:50:00Z"
        }
    },
    {
        "product_name": "EcoShop",
        "product_image": "https://i.ibb.co/LSgxLZN/120300.jpg",
        "description": "EcoShop offers eco-friendly products for a sustainable lifestyle. The platform features a wide range of products, including reusable items, organic goods, and energy-efficient devices. EcoShop is committed to promoting sustainability and reducing environmental impact. Each product is carefully curated to ensure it meets high standards of quality and eco-friendliness. By shopping at EcoShop, you can make a positive impact on the environment while enjoying high-quality products. Discover eco-friendly alternatives for your everyday needs with EcoShop.",
        "product_owner_info": {
            "owner_name": "Robert Gray",
            "owner_image": "https://ibb.co/Tvr2zM3",
            "owner_email": "robertgray@example.com"
        },
        "tags": [
            "eco-friendly",
            "sustainability",
            "shopping"
        ],
        "external_links": [
            "https://ecoshop.com",
            "https://github.com/ecoshop"
        ],
        "upvote_count": 210,
        "downvote_count": 4,
        "creation_time": {
            "$date": "2023-06-01T08:20:00Z"
        }
    },
    {
        "product_name": "Artify",
        "product_image": "https://i.ibb.co/pyM8NbN/2149207999.jpg",
        "description": "Artify is a platform for discovering and sharing digital art. Artify connects artists with art enthusiasts, providing a space to showcase and sell digital artwork. The platform offers a variety of tools for artists to create, share, and monetize their work. Users can explore a diverse collection of digital art, follow their favorite artists, and purchase unique pieces. Artify also hosts community events, challenges, and collaborations to foster creativity and engagement within the digital art community.",
        "product_owner_info": {
            "owner_name": "Sarah Green",
            "owner_image": "https://ibb.co/b6WcNFG",
            "owner_email": "sarahgreen@example.com"
        },
        "tags": [
            "art",
            "digital",
            "creativity"
        ],
        "external_links": [
            "https://artify.com",
            "https://github.com/artify"
        ],
        "upvote_count": 175,
        "downvote_count": 5,
        "creation_time": {
            "$date": "2023-06-02T10:45:00Z"
        }
    },
    {
        "product_name": "CodeHelper",
        "product_image": "https://i.ibb.co/6ZWByPY/2150062002.jpg",
        "description": "CodeHelper is an all-in-one toolkit for developers, offering features such as code snippets, debugging tools, and real-time collaboration. It's designed to streamline the coding process, reduce errors, and enhance productivity. CodeHelper supports multiple programming languages and integrates seamlessly with popular IDEs. Whether you're a seasoned programmer or a beginner, CodeHelper provides the resources and support you need to write clean, efficient code. The platform also includes a community forum where developers can share tips, ask questions, and collaborate on projects.",
        "product_owner_info": {
            "owner_name": "John Smith",
            "owner_image": "https://ibb.co/KGXsMMc",
            "owner_email": "johnsmith@example.com"
        },
        "tags": [
            "coding",
            "development",
            "software"
        ],
        "external_links": [
            "https://codehelper.com",
            "https://github.com/codehelper"
        ],
        "upvote_count": 230,
        "downvote_count": 3,
        "creation_time": {
            "$date": "2023-06-03T13:00:00Z"
        }
    },
    {
        "product_name": "MarketInsight",
        "product_image": "https://i.ibb.co/qRhzTWz/124214.jpg",
        "description": "MarketInsight provides comprehensive market analysis tools for businesses. Utilizing advanced data analytics and AI, MarketInsight delivers actionable insights into market trends, consumer behavior, and competitive landscapes. Businesses can use these insights to make informed decisions, optimize marketing strategies, and drive growth. The platform offers customizable dashboards, detailed reports, and predictive analytics to help businesses stay ahead of the curve. Whether you're a small startup or a large corporation, MarketInsight equips you with the knowledge you need to succeed in today's dynamic market environment.",
        "product_owner_info": {
            "owner_name": "John Smith",
            "owner_image": "https://ibb.co/KGXsMMc",
            "owner_email": "johnsmith@example.com"
        },
        "tags": [
            "market analysis",
            "business",
            "analytics"
        ],
        "external_links": [
            "https://marketinsight.com",
            "https://github.com/marketinsight"
        ],
        "upvote_count": 260,
        "downvote_count": 2,
        "creation_time": {
            "$date": "2023-06-04T09:15:00Z"
        }
    },
    {
        "product_name": "MusicStream",
        "product_image": "https://i.ibb.co/x70WCWq/54980.jpg",
        "description": "MusicStream is a music streaming platform that offers a vast library of songs across various genres. Users can create playlists, discover new music, and share their favorites with friends. MusicStream's advanced recommendation system suggests songs based on your listening habits, ensuring you always have fresh music to enjoy. The platform also supports offline listening, high-quality audio streaming, and integration with social media. Whether you're a casual listener or a music enthusiast, MusicStream provides an unparalleled music experience.",
        "product_owner_info": {
            "owner_name": "Sarah Green",
            "owner_image": "https://ibb.co/b6WcNFG",
            "owner_email": "sarahgreen@example.com"
        },
        "tags": [
            "music",
            "streaming",
            "entertainment"
        ],
        "external_links": [
            "https://musicstream.com",
            "https://github.com/musicstream"
        ],
        "upvote_count": 190,
        "downvote_count": 4,
        "creation_time": {
            "$date": "2023-06-05T11:30:00Z"
        }
    },
    {
        "product_name": "PhotoEditPro",
        "product_image": "https://i.ibb.co/mvcC5p4/46864.jpg",
        "description": "PhotoEditPro is a professional photo editing software designed for photographers and graphic designers. With a wide range of tools and features, PhotoEditPro allows users to enhance their images, apply filters, and create stunning visual effects. The software supports various file formats and offers advanced editing capabilities such as layers, masks, and blending modes. PhotoEditPro also includes AI-powered features like automatic background removal and facial recognition. Whether you're editing photos for personal use or professional projects, PhotoEditPro provides the tools you need to achieve high-quality results.",
        "product_owner_info": {
            "owner_name": "Sarah Green",
            "owner_image": "https://ibb.co/b6WcNFG",
            "owner_email": "sarahgreen@example.com"
        },
        "tags": [
            "photo editing",
            "software",
            "design"
        ],
        "external_links": [
            "https://photoeditpro.com",
            "https://github.com/photoeditpro"
        ],
        "upvote_count": 220,
        "downvote_count": 5,
        "creation_time": {
            "$date": "2023-06-06T12:45:00Z"
        }
    },
    {
        "product_name": "HomeChef",
        "product_image": "https://i.ibb.co/3kXxNjz/2148939251.jpg",
        "description": "HomeChef is a meal kit delivery service that makes cooking at home easy and enjoyable. Each week, HomeChef delivers fresh, pre-portioned ingredients and step-by-step recipes to your door. The recipes are designed by professional chefs and cater to a variety of dietary preferences and skill levels. HomeChef also offers customization options, allowing you to adjust ingredients and portion sizes to suit your needs. With HomeChef, you can explore new cuisines, improve your cooking skills, and enjoy delicious homemade meals without the hassle of grocery shopping.",
        "product_owner_info": {
            "owner_name": "David williamson",
            "owner_image": "https://ibb.co/4FF340j",
            "owner_email": "davidwilliamson@example.com"
        },
        "tags": [
            "meal kits",
            "cooking",
            "food delivery"
        ],
        "external_links": [
            "https://homechef.com",
            "https://github.com/homechef"
        ],
        "upvote_count": 205,
        "downvote_count": 3,
        "creation_time": {
            "$date": "2023-06-07T14:00:00Z"
        }
    },
    {
        "product_name": "FitLife",
        "product_image": "https://i.ibb.co/NyBvZ1W/2150165162.jpg",
        "description": "FitLife provides workout plans and health tips for a balanced life. The app offers personalized fitness plans based on your goals, whether it's losing weight, building muscle, or maintaining overall health. FitLife includes video tutorials, progress tracking, and nutritional advice to support your fitness journey. The app also features a community aspect, allowing users to connect, share their progress, and motivate each other. With FitLife, you can achieve your fitness goals while staying motivated and informed.",
        "product_owner_info": {
            "owner_name": "Kevin Blue",
            "owner_image": "https://i.ibb.co/qJpmJD5/137665.jpg",
            "owner_email": "kevinblue@example.com"
        },
        "tags": [
            "fitness",
            "health",
            "workout"
        ],
        "external_links": [
            "https://fitlife.com",
            "https://github.com/fitlife"
        ],
        "upvote_count": 185,
        "downvote_count": 6,
        "creation_time": {
            "$date": "2023-06-08T08:45:00Z"
        }
    },
    {
        "product_name": "ShopSmart",
        "product_image": "https://i.ibb.co/HDP04Ps/127542.jpg",
        "description": "ShopSmart is a price comparison tool that helps you find the best deals on products. By scanning multiple online retailers, ShopSmart provides real-time price comparisons and alerts you to discounts and special offers. The platform features a user-friendly interface, product reviews, and detailed specifications to assist you in making informed purchasing decisions. ShopSmart also offers personalized recommendations based on your shopping habits. Save money and shop smarter with ShopSmart.",
        "product_owner_info": {
            "owner_name": "Robert Gray",
            "owner_image": "https://ibb.co/Tvr2zM3",
            "owner_email": "robertgray@example.com"
        },
        "tags": [
            "shopping",
            "deals",
            "price comparison"
        ],
        "external_links": [
            "https://shopsmart.com",
            "https://github.com/shopsmart"
        ],
        "upvote_count": 225,
        "downvote_count": 4,
        "creation_time": {
            "$date": "2023-06-09T10:20:00Z"
        }
    },
    {
        "product_name": "GreenHome",
        "product_image": "https://i.ibb.co/QCJws22/2149383652.jpg",
        "description": "GreenHome provides eco-friendly home improvement tips and products. The platform offers a wide range of sustainable solutions for energy efficiency, water conservation, and waste reduction. GreenHome features expert advice, DIY guides, and product reviews to help you create a more environmentally friendly living space. Whether you're renovating your home or looking for small changes to reduce your environmental impact, GreenHome provides the resources and inspiration you need to live sustainably.",
        "product_owner_info": {
            "owner_name": "Kevin Blue",
            "owner_image": "https://i.ibb.co/qJpmJD5/137665.jpg",
            "owner_email": "kevinblue@example.com"
        },
        "tags": [
            "sustainability",
            "home improvement",
            "eco-friendly"
        ],
        "external_links": [
            "https://greenhome.com",
            "https://github.com/greenhome"
        ],
        "upvote_count": 240,
        "downvote_count": 2,
        "creation_time": {
            "$date": "2023-06-10T12:35:00Z"
        }
    },
    {
        "product_name": "MindfulMeditate",
        "product_image": "https://i.ibb.co/vhyVFg1/5521.jpg",
        "description": "MindfulMeditate offers guided meditation sessions and mindfulness exercises. Designed to help users reduce stress, improve focus, and enhance well-being, MindfulMeditate provides a variety of meditation practices for all experience levels. The app features calming music, nature sounds, and customizable meditation timers. MindfulMeditate also includes tips and resources for incorporating mindfulness into daily life. Whether you're a beginner or an experienced meditator, MindfulMeditate supports your journey towards a more balanced and peaceful life.",
        "product_owner_info": {
            "owner_name": "Daniel King",
            "owner_image": "https://i.ibb.co/mtvbKbL/222.jpg",
            "owner_email": "danielking@example.com"
        },
        "tags": [
            "meditation",
            "mindfulness",
            "well-being"
        ],
        "external_links": [
            "https://mindfulmeditate.com",
            "https://github.com/mindfulmeditate"
        ],
        "upvote_count": 210,
        "downvote_count": 3,
        "creation_time": {
            "$date": "2023-06-11T09:10:00Z"
        }
    },
    {
        "product_name": "BookClub",
        "product_image": "https://i.ibb.co/vV85XM4/127665.jpg",
        "description": "BookClub connects readers with a community of book enthusiasts. The platform allows users to join virtual book clubs, participate in discussions, and share reviews. BookClub features a wide range of genres, ensuring there's something for everyone. Users can create reading lists, track their progress, and receive personalized book recommendations. BookClub also hosts author Q&A sessions and live events. Whether you're an avid reader or just looking for your next great read, BookClub provides a space to explore and enjoy books with others.",
        "product_owner_info": {
            "owner_name": "Robert Gray",
            "owner_image": "https://ibb.co/Tvr2zM3",
            "owner_email": "robertgray@example.com"
        },
        "tags": [
            "books",
            "reading",
            "community"
        ],
        "external_links": [
            "https://bookclub.com",
            "https://github.com/bookclub"
        ],
        "upvote_count": 200,
        "downvote_count": 5,
        "creation_time": {
            "$date": "2023-06-12T11:55:00Z"
        }
    }
]